[
  {
    "id": "chocolate-malted-potato-chip-cupcake",
    "title": "Chocolate Malted Potato Chip Cupcake",
    "isBestSeller": false,
    "price": "$15",
    "description": "Sweet, salty, and upcycled, too. This riff on a flavor from our recipe vault packs two snack-time opposites into one hedonistic scoop.",
    "full-description": "Sweet, salty, and upcycled, too. This riff on a flavor from our recipe vault packs two snack-time opposites into one hedonistic scoop. First, the sweet: fudgy chocolate cupcakes baked with Renewal Mill's dark chocolate baking mix, made with okara, a soy flour upcycled from plant-based milk. Glazed in chocolate, they're set aside while we create the salty: chocolate-dipped Uglies kettle potato chips. Their deep ridges and quirky curves catch extra oil and chocolate, making them even more delicious. Finally, both chocolate-coated creations are folded into malty, upcycled barley milk ice cream. To finish, a thick ribbon of caramel—because, honestly, why wouldn't we?",
    "thumbnail": "/examples/menu/Salt-and-Straw_APR25_CHIPCUPCAKE_Macro.webp",
    "sustainability": "2,862 pounds of food waste diverted through our partnership with Renewal Mill and Uglies Kettle Potato Chips",
    "details": {
      "notes": "An upcycled riff on our famous Chocolate Caramel Potato Chip Cupcake made with a 50/50 blend of malty chocolate barley milk and cream. The fudgy, ultra-moist cupcakes start with Renewal Mill's dark chocolate brownie mix, created from upcycled okara, a fiber-packed, gluten-free flour made from leftover soymilk. Glazed with chocolate, they're irresistible and sustainable. The chocolate-dipped potato chips aren't just any chips—they're Uglies Potato Chips, and their 'ugly', irregular nooks and crannies catch extra oil and chocolate, making every bite even more craveable. The last step in creating this flavor is drizzling in a thick ribbon of caramel to bring it completely over-the-top.",
      "partner-story": "Okara is only one of the five upcycled ingredients Renewal Mill uses to create their sustainable baking mixes and flours. By transforming nutritious byproducts like oat protein and pineapple into high-quality ingredients, they're making it easier than ever to bake with less waste. They've been our partners for several years—long before we even started The Upcycled Series—because we believe in the quality of their ingredients and their delicious results. \n\nIn the U.S., 26% of produce is discarded for cosmetic reasons. Uglies Potato Chips is tackling this problem head-on by rescuing perfectly good (but imperfect-looking) potatoes and turning them into crunchy, golden kettle chips. Since 2017, they've saved 30 million pounds of potatoes, reducing waste while supporting farmers.",
      "ingredients": "Water, Sugar, Cream, Milk, Coconut Oil (allergen-free), Tapioca Syrup, Renewal Mill Brownie Mix (cane sugar, natural cocoa powder, brown rice flour, okara flour [soy], pea starch, sea salt, baking soda, vanilla [dextrose, vanilla beans], xanthan gum), Cocoa Powder (processed w/ alkali), EverPro (upcycled barley rice protein), Chocolate (sugar, cocoa powder [processed w/ alkali], cocoa butter, soy lecithin, sunflower lecithin, vanilla extract, vanilla beans), Butter, Uglies Kettle Chips (potatoes, vegetable oil [safflower oil and or sunflower oil], sea salt), Molasses, Tapioca Starch, Sunflower Oil, Vanilla Extract, Guar Gum, Carrageenan, Salt, Xanthan Gum, Citric Acid",
      "allergens": "Contains: Milk, Soy\nDietary Restrictions: Gluten (barley)",
      "nutrition": "Three (3) servings per pint. Each serving 2/3 cup. Calories per serving: 390"
    },
    "category": "upcycled",
    "tags": ["chocolate", "potato chip", "caramel", "sustainable", "upcycled"]
  },
  {
    "id": "coffee-and-stone-fruit-marmalade",
    "title": "Coffee and Stone Fruit Marmalade",
    "isBestSeller": false,
    "price": "$15",
    "description": "A deceptively simple flavor that's actually 28 elements complex—not including the stone fruit!",
    "full-description": "A deceptively simple flavor that's actually 28 elements complex—not including the stone fruit! Atomo blends a variety of farm-sourced, upcycled, and superfood ingredients, like date seeds, millet and guava, to create a sustainable \"beanless\" coffee that tastes and smells just like the real thing without the environmental impact. We churn their 100% beanless and Arabica medium roast into a robust coffee ice cream for a rich, bold finish. Then comes the marmalade drizzle, made with Hello! I'm Ugly dried nectarines and apricots, slow-cooked with butter, cinnamon, and brown sugar until it turns irresistibly jammy. Coffee and fruit is having a moment, and our take on the trend takes on food waste, too.",
    "thumbnail": "/examples/menu/Salt-and-Straw_APR25_MARMALADE_Macro.webp",
    "sustainability": "1,657 pounds of food waste diverted through our partnership with Atomo Coffee and Hello! I'm Ugly",
    "details": {
      "notes": "This brand-new flavor takes inspiration from a rising coffeehouse trend—pairing acidic stone fruits with coffee, like an apricot cold brew. We churn Atomo's 50/50 blend of beanless and Arabica medium roast into our ice cream base for a rich, bold flavor. To create our dried stone fruit marmalade, we cook down Hello I'm Ugly's dried nectarines and apricots with butter, cinnamon, and brown sugar. Pastry chefs love making marmalade from dried fruit because its naturally concentrated flavor lets us pack in 5–6 times more intensity than fresh fruit. Drizzled into the ice cream, this marmalade adds a tart, fruity contrast to the deep coffee notes.",
      "partner-story": "We teamed up with two innovative partners tackling food waste in unique ways. Atomo Coffee, a Seattle-based startup, brews up a 'beanless coffee' using upcycled ingredients, while Hello I'm Ugly rescues perfectly good but 'ugly' fruit and turns it into ridiculously tasty dried snacks. \n\nAtomo replicates the complex flavors of traditional coffee by blending 28 key compounds sourced from farm-fresh superfoods and upcycled ingredients, like date seeds, fenugreek, lemon, guava, strawberry fiber, millet, green tea, and green banana flour. By using these ingredients, they've created a lower-impact alternative that helps build a more resilient food system. Every pound of Atomo's beanless coffee generates 83% less carbon emissions and uses 70% less farmland than conventional coffee—without sacrificing flavor. \n\nHello I'm Ugly was founded in 2018 by Ben Moore, a fourth-generation farmer from California's Central Valley. After watching perfectly good fruit go to waste just because it didn't meet grocery store 'beauty' standards, he set out to change the system. Today, the company transforms 'ugly' fruit into delicious dried snacks, fighting food waste with every package. By this year, their goal is to prevent 12 million pounds of food from going to waste—all by changing how people see 'ugly.'",
      "ingredients": "Milk, Cream, Water, Sugar, Brown Sugar, Atomo Beanless Coffee (upcycled date seeds, ramon seeds, green banana, sunflower seed extract, fructose, pea protein, carob, millet, strawberry fiber, defatted fenugreek seeds, lemon, guava, black aronia berry, caffeine), Tapioca Syrup, Dried Nectarines, Dried Apricots, Vanilla Extract, Salt, Butter, Coffee, Molasses, Guar Gum, Carrageenan, Cinnamon, Cardamom",
      "allergens": "Contains: Milk\nDietary Restrictions: Trace Caffeine",
      "nutrition": "Three (3) servings per pint. Each serving 2/3 cup. Calories per serving: 310"
    },
    "category": "upcycled",
    "tags": ["coffee", "stone fruit", "marmalade", "sustainable", "upcycled"]
  },
  {
    "id": "salted-grapefruit-coconut-julep",
    "title": "Salted Grapefruit Coconut Julep",
    "isBestSeller": false,
    "price": "$15",
    "description": "The classic Derby cocktail on a Caribbean vacation.",
    "full-description": "The classic Derby cocktail on a Caribbean vacation. Lush coconut cream blends with tart, tangy cacao pulp—typically discarded after the beans are harvested—creating the tropical backdrop for our julep-inspired sipper. For this, we partnered with Wheyward Spirit. Their handcrafted, barrel-aged 'wheyskey' is distilled from upcycled excess whey, created during the cheese-making process. Its warm, vanilla-oak notes bring depth to our salted grapefruit cocktail, which we churn into the citrusy coconut cream. This julep skips the mint, and the waste, but still goes down smooth.",
    "thumbnail": "/examples/menu/Salt-and-Straw_APR25_JULEP_Macro.webp",
    "sustainability": "1,191 pounds of food waste diverted through our partnership with Wheyward Spirit and our cacao pulp suppliers",
    "details": {
      "notes": "This creamy, tropical scoop takes inspiration from a piña colada, but with a twist. Instead of rum, we use 'wheysky,' earning it the 'julep' name. It begins with coconut cream infused with cacao pulp, then we mix in a salted grapefruit cocktail made with Wheyward Spirit 'wheyskey.' The result is a dense, luscious yet refreshing bite.",
      "partner-story": "For every 10 pounds of milk a cheesemaker uses, only 1 pound becomes cheese. The remaining 9 pounds is high-quality whey, which often gets discarded. Wheyward Spirit gives this overlooked byproduct new life, transforming it into award-winning, smooth, and sippable spirits. Committed to sustainability, they're reducing food waste, supporting local agriculture, and redefining the spirits industry. Their Wheyward Spirit and barrel-aged Wheyward Wheyskey offer a one-of-a-kind alternative to traditional spirits, proving that great taste and responsible sourcing can go hand in hand.",
      "ingredients": "Coconut Cream, Water, Sugar, Cacao Pulp, Grapefruit Juice Concentrate, Tapioca Syrup, Salt, Vanilla Extract, Wheyward Spirits Wheyskey, Xanthan Gum, Pineapple Juice Concentrate, Orange Bitters (water, glycerine, alcohol, natural orange spice flavor, natural flavors, beta-carotene [color]), Citric Acid, Artificial Color (water, sugar, red 40, red 3, yellow 6, yellow 5, modified corn starch, vegetable gum, citric acid, sodium benzoate, potassium sorbate)",
      "allergens": "Contains: Tree Nuts (Coconut), Milk\nDietary Restrictions: Artificial Color, Trace Alcohol",
      "nutrition": "Three (3) servings per pint. Each serving 2/3 cup. Calories per serving: 270"
    },
    "category": "upcycled",
    "tags": ["coconut", "grapefruit", "wheyskey", "sustainable", "upcycled"]
  },
  {
    "id": "banana-parsnip-sherbet",
    "title": "Banana Parsnip Sherbet",
    "isBestSeller": false,
    "price": "$15",
    "description": "An unlikely duo that just works.",
    "full-description": "An unlikely duo that just works. Our friends at Urban Gleaners—a nonprofit on a mission to reduce food waste and fight food insecurity—rescue ripe bananas from local grocery stores, then deliver them straight to our kitchen. We roast them by the bunch with honey and cinnamon, transforming them into a sticky-sweet, spiced purée. Blended with the rich earthiness of parsnips, plus cream, vanilla and a splash of bourbon, it becomes a sherbet that turns overlooked ingredients into an unforgettable scoop.",
    "thumbnail": "/examples/menu/Salt-and-Straw_APR25_PARSNIP_Macro.webp",
    "sustainability": "1,189 pounds of food waste diverted through our partnership with Urban Gleaners",
    "details": {
      "notes": "This sherbet first appeared in our cookbook, but our partnership with Urban Gleaners makes it upcycled. Its unexpected blend of banana and parsnip—a personal favorite of our Head Ice Cream Maker, Tyler—brings out the best in both ingredients. Roasted bananas and cooked parsnips are blended with a touch of cream, vanilla, and a splash of bourbon, creating a rich, earthy sherbet.",
      "partner-story": "Urban Gleaners fights food insecurity by rescuing surplus food from restaurants, grocery stores, and farms, then redistributing it to families, schools, and community organizations across Portland. By turning potential waste into much-needed meals, they provide reliable access to fresh food while reducing food waste and fostering a more sustainable, equitable food system. \n\nOperating over 40 sites across Multnomah and Washington counties, Urban Gleaners offers families a dignified way to access nutritious food. Each year, they rescue nearly 1.5 million pounds of food, feeding over 8,000 food-insecure families every week. Since their founding in 2006, they've diverted 11 million pounds of food from landfills—one meal at a time.",
      "ingredients": "Water, Milk, Sugar, Cream, Bananas, Parsnip Puree, Tapioca Syrup, Honey, Bourbon, Vanilla Extract, Xanthan Gum, Salt, Cinnamon, Lemon Juice, Guar Gum, Carrageenan",
      "allergens": "Contains: Milk\nDietary Restrictions: Trace Alcohol",
      "nutrition": "Three (3) servings per pint. Each serving 2/3 cup. Calories per serving: 220"
    },
    "category": "upcycled",
    "tags": ["banana", "parsnip", "sherbet", "sustainable", "upcycled"]
  },
  {
    "id": "sourdough-olive-oil-chocolate",
    "title": "Sourdough and Olive Oil Chocolate (v)",
    "isBestSeller": false,
    "price": "$15",
    "description": "An inversion of what we imagine the French waking up to: freshly baked pain au chocolat.",
    "full-description": "An inversion of what we imagine the French waking up to: freshly baked pain au chocolat. Flaky layers of buttery, golden pastry encase rich, dark chocolate in this classic baked treat. For our vegan, upcycled interpretation, we flipped the script, making chocolate the focal point. Breweries' spent grains lend a deep, toasty maltiness to our chocolate barley milk, enriched with a generous pour of Arbequina extra-virgin olive oil. In this reinvention, candied hunks of sourdough bread takes on the role of 'pain,' folding into the olive-oil laced chocolate—a testament to how yesterday's grains can become today's most decadent bite.",
    "thumbnail": "/examples/menu/Salt-and-Straw_APR25_SOURDOUGH_Macro.webp",
    "sustainability": "1,095 pounds of food waste diverted through our partnership with evergrain",
    "details": {
      "notes": "This new dairy-free flavor reimagines pain au chocolat, the classic French pastry with buttery, flaky layers wrapped around rich, melted chocolate. evergrain barley milk—our go-to favorite for vegan chocolate flavors—adds a natural malty, bread-like depth that pairs beautifully with the candied sourdough hunks. For an extra layer of richness, we blend in a generous pour of Durant Olive Mill's Arbequina Extra-Virgin Olive Oil, the same one that makes our classic Arbequina Olive Oil ice cream so luscious.",
      "partner-story": "Brewing beer creates a byproduct called brewer's spent grain, which the industry has historically sent to landfills or turned into animal feed. But evergrain takes these leftover grains and upcycles them into high-quality proteins and fibers that make food and drinks more nutritious. Their everpro barley milk is packed with protein, and one of our favorites to use, even outside of The Upcycled Series, for its natural malty flavor.",
      "ingredients": "Water, Sugar, Coconut Oil (allergen-free), Tapioca Syrup, Sourdough Bread (enriched wheat flour [wheat flour, malted barley flour, niacin, reduced iron, thiamine mononitrate, riboflavin, folic acid, ascorbic acid, enzyme], water, salt), EverPro (upcycled barley rice protein), Cocoa Powder (processed w/ alkali), Olive Oil, Molasses, Semisweet Chocolate (sugar, cocoa [processed w/ alkali], cocoa butter, soy lecithin, vanilla extract), Vanilla Extract, Salt, Vinegar, Citric Acid, Xanthan Gum",
      "allergens": "Contains: Wheat, Soy\nDietary Restrictions: Gluten (barley)",
      "nutrition": "Three (3) servings per pint. Each serving 2/3 cup. Calories per serving: 300"
    },
    "category": "upcycled",
    "tags": ["chocolate", "sourdough", "olive oil", "sustainable", "upcycled", "vegan"]
  },
  {
    "id": "arbequina-olive-oil",
    "title": "Arbequina Olive Oil",
    "isBestSeller": false,
    "price": "$15",
    "description": "A simple combination thanks to incredible Oregon olive oil. We love enhancing its tropical, grassy flavors and rich, buttery texture in ice cream.",
    "full-description": "A simple combination thanks to incredible Oregon olive oil. We love enhancing its tropical, grassy flavors and rich, buttery texture in ice cream. Made with Durant Olive Mill's Arbequina Extra-Virgin Olive Oil.",
    "thumbnail": "/examples/menu/SaltandStraw_ArbequinaOliveOil.webp",
    "details": {
      "notes": "Find us salivating. Ice cream is one of the best ways to fully appreciate the flavor of high-quality olive oil. The sweet, simple richness of cream and sugar is the perfect backdrop to let grassy, tropical flavors do their thing. For a real nerd alert, most ice creams contain just one type of fat—butterfat from dairy. But in this case, the oil joins the fun. Technically, they don't combine, but because they're frozen, they hold together in a group hug, creating a lush texture halfway between creamy and silky.",
      "partner-story": "Did you know that olives can be grown in Oregon? Not only are olives grown in Oregon, but the family farm, Durant Olive Mill, has pioneered new techniques to grow their olives using a Spanish olive tree variety called Arbequina (pronounced: are-beh-key-nah). The Durant family leans into the colder climate in Oregon and presses their oil each Fall to create an olive oil that doesn't develop the spicy, bitter flavors you taste in California olive oils. Instead, we get delicate, slightly grassy flavors with a hint of tropical (almost pineapple) flavor. Nestled in the heart of Oregon's Willamette Valley, Durant crafts small-batch, artisanal olive oils and vinegars. With a commitment to sustainable farming practices, they offer a unique tasting experience, showcasing the rich flavors of locally grown olives.",
      "ingredients": "Milk, Cream, Sugar, Arbequina Olive Oil, Tapioca Syrup, Water, Salt, Guar Gum, Carrageenan",
      "allergens": "Contains: Milk",
      "nutrition": "Three (3) servings per pint. Each serving 2/3 cup. Calories per serving: 380"
    },
    "category": "classic",
    "tags": ["olive oil", "classic"]
  },
  {
    "id": "chocolate-gooey-brownie",
    "title": "Chocolate Gooey Brownie",
    "isBestSeller": true,
    "bestSellerLabel": "/examples/menu/icon-badge-best-seller.svg",
    "price": "$15",
    "description": "For anyone who eats brownies warm right out of the pan. We fold our housemade marshmallow fluff into intensely chocolate-y brownie batter so each piece stays fudgy in ice cream.",
    "full-description": "For anyone who eats brownies warm right out of the pan. We fold our housemade marshmallow fluff into intensely chocolate-y brownie batter so each piece stays fudgy in ice cream.",
    "thumbnail": "/examples/menu/SaltandStraw_ChocolateGooeyBrownie.jpg",
    "details": {
      "notes": "Debuting alongside Sea Salt with Caramel Ribbons on Earth Day 2011, this flavor has been a staple on our Classics Menu since we opened our first shop. We aimed to capture the quintessential taste of pure chocolate ice cream and homemade brownies. For this, we use Valrhona cocoa powder, a renowned ingredient in the pastry world and favored by Michelin-starred chefs. This high-quality cocoa powder ensures a rich chocolate flavor without the interference of extra cocoa butter from chocolate chips. Our brownies are crafted to remain soft and chewy even when frozen, showcasing our commitment to perfecting every ingredient for the ultimate eating experience.",
      "ingredients": "Milk, Cream, Brownies (sugar, wheat flour, butter, eggs, cocoa powder [processed w/ alkali], rice syrup, water, corn starch, sunflower lecithin, salt, vanilla extract, baking soda, baking powder), Sugar, Tapioca Syrup, Cocoa Powder (processed w/ alkali), Guar Gum, Carrageenan",
      "allergens": "Milk, Wheat, Eggs",
      "nutrition": "Three (3) servings per pint. Each serving 2/3 cup. Calories per serving: 360"
    },
    "category": "classic",
    "tags": ["chocolate", "brownie", "classic"]
  },
  {
    "id": "cinnamon-snickerdoodle",
    "title": "Cinnamon Snickerdoodle",
    "isBestSeller": false,
    "price": "$15",
    "description": "We fold our house-baked chewy snickerdoodle cookies into ice cream that's spiked with the most intensely spiced, warm cinnamon.",
    "full-description": "We fold our house-baked chewy snickerdoodle cookies into ice cream that's spiked with the most intensely spiced, warm cinnamon.",
    "thumbnail": "/examples/menu/SaltandStraw_Cinnamon-Snickerdoodle.webp",
    "details": {
      "notes": "An intensely spicy cinnamon ice cream with hunks of soft, chewy, snickerdoodle cookies hits at the heart of Salt & Straw, using Grandma Malek's recipe and Tyler's earliest cooking memory. As part of our original 2011 menu, we home-bake our Snickerdoodle cookies with extra tartar cream and baking soda for a light texture that remains tender and moist when frozen. The extra-light texture makes the cookies soak up just the right amount of cream, giving them that \"pulled from the oven\" texture, creating a deliciously evocative and globally conscious treat. How so? We partner with Red Ape Cinnamon (the best cinnamon we've ever tasted), which is ground in small batches to retain its rich, aromatic flavor.",
      "partner-story": "Our snickerdoodle recipe is salty, doughy, slightly acidic—and spicy, thanks to Red Ape Cinnamon from Eugene, Oregon. The cinnamon is ground in a slower kind of grinding machine in small batches, ensuring a rich, aromatic cinnamon that retains all its distinct flavors. As its namesake, Red Ape also donates 5% of their profits to help save the endangered orangutans of Sumatra.",
      "ingredients": "Milk, Cream, Sugar, Flour (bleached wheat flour, malted barley flour, niacin, reduced iron, thiamine mononitrate, riboflavin, folic acid), Tapioca Syrup, Butter, Eggs, Cinnamon, Cream of Tartar, Salt, Baking Soda, Guar Gum, Carrageenan",
      "allergens": "Milk, Wheat, Eggs",
      "nutrition": "Three (3) servings per pint. Each serving 2/3 cup. Calories per serving: 360"
    },
    "category": "classic",
    "tags": ["cinnamon", "snickerdoodle", "cookie", "classic"]
  }
]